yii2/backend/controllers/CommonController.php

SELECT `r`.`role_name`, `n`.`controller`, `n`.`action` FROM `admin` LEFT JOIN `premission` `p_a` ON p_a.admin_id=admin.id LEFT JOIN `role` `r` ON r.id=p_a.role_id LEFT JOIN `privillage` `p_n` ON p_n.role_id=r.id LEFT JOIN `node` `n` ON n.id=p_n.node_id WHERE admin.id=1
---
	public function beforeAction($action){
		$db = yii::$app->db;
        $root_id  = Yii::$app->session->get('root');
        $username=yii::$app->session->get('username');
        //判断是否有登录session
        if(!isset($root_id)){
            // echo "<script>alert('请先登录');location.href='index.php?r=login/index'</script>";die;
        }
        if(!isset($username)){
            // echo "<script>alert('请先登录');location.href='index.php?r=login/index'</script>";die;
        }
        //设置超级管理员
        if($username=="周可"){
            return true;
        }
        //判断权限
        $ctl=Yii::$app->controller->id;     //获取当前访问的控制器

        $action=Yii::$app->controller->action->id;     //获取当前访问的方法
        $aa = $ctl.','.$action;
        $bb=['index,index','index,main','index,head'];
        //当访问后台是首页权限是公共的
        if(in_array($aa,$bb)){
            return true;
        }else{
            //设置超级管理员
            $query = new Query();
            $data = $query
                ->select('r.role_name,n.controller,n.action')
                ->from('admin')
                ->join('LEFT JOIN','premission p_a','p_a.admin_id=admin.id')
                ->join('LEFT JOIN','role r','r.id=p_a.role_id')
                ->join('LEFT JOIN','privillage p_n','p_n.role_id=r.id')
                ->join('LEFT JOIN','node n','n.id=p_n.node_id')
                ->where('admin.id='.$root_id)
                ->all();