yii2/backend/controllers/GoodsController.php

    public function actionDel_goods(){
        $goods_id = yii::$app->request->post('goods_id');
        $sql = 'select category_id,images_id,goods_img from goods WHERE id ='.$goods_id;
        $data = yii::$app->db->createCommand($sql)->queryOne();
        //删除商品文件
        if (file_exists($data['goods_img'])){
            unlink($data['goods_img']);
        }
        //删除文件相册图片
        $sql = 'select m_path from images where goods_id='.$goods_id;
        $path = yii::$app->db->createCommand($sql)->queryAll();
        foreach($path as $v){
            if (file_exists($v['m_path'])){
                unlink($v['m_path']);
            }
        }

        //删除商品属性
        Yii::$app->db->createCommand()->delete('goods_attr', 'goods_id = '.$goods_id)->execute();
        //删除商品SKU
        Yii::$app->db->createCommand()->delete('products', 'goods_id = '.$goods_id)->execute();
        //删除图片相册图片
        Yii::$app->db->createCommand()->delete('images', 'goods_id = '.$goods_id)->execute();
---
DELETE FROM `goods_attr` WHERE goods_id = 1
DELETE FROM `goods` WHERE id = 1
DELETE FROM `products` WHERE goods_id = 1
DELETE FROM `images` WHERE goods_id = 1