yii2/backend/controllers/OrderController.php

DELETE FROM `order_info` WHERE id =13
---
	public function actionDelete(){
		$id = yii::$app->request->get('id');
		$arr = Yii::$app->db->createCommand()->delete('order_info', 'id = '.$id)->execute();